#1. Зробити зі списка новий список елнментами якого будуть добуток
# всіх чисел масива крім поточного:
# [1,2,3,4] ---> [24, 12, 8, 6]
# [4, 5, 10] —-> [5*10, 4*10, 4*5] —> [50, 40, 20]

#  l = [1, 2, 3, 4]


#2 Перевірити чи є строка емейлом: ( необхідно перевірити чи є
# строка формату xxxxxx@xxx.xx, перша буква не є цифрою, не містить
# ніяких спецсимволів типу % і ?, а також має довжину першої частини
# більше ніж 3


#3 Вивести в циклі всі парні числа до 100, крім 6, 8, 86 якщо число 90
# зустрінеться в списку то перервати його роботу

# for i in range (100):
#     if i % 2 == 0:
#         if i == 90:
#             break
#         elif i == 6 or i == 8 or i == 86:
#             continue
#         else:
#             print(i)



#4 Скільки існує комбінацій пароля 4 символів, якщо відомо що
# друга цифра 4, 5 або 7, перша не 0, третя менша 6 а четверта більша 7







#5 . За допомогою filter залишити в списку тільки парні числа
#
# a = [-2, -3, 3, 2, 1]
#
# def fil(x):
# 	if x > 0 and x % 2 == 0:
# 		return x
#
# res = list(filter(fil,a))

# print(res)




#6 Є файл з даними учнів у форматі Прізвище;ім’я;зріст
# Написати функцію що зчитує дані з файлу, функцію що добавляє
# учня до списку, функцію що перевіряє чи є валідним формат
# даних що вводить користувач, три функції що обчислюють максимальний
# , мінімальний і середній зріст


lst = []
with open ('new.txt', 'r') as f:

    for i in f.readlines():
        tmp = i[:-1].split('; ')
        lst.append(
            {
                'Surname': tmp[0],
                'Name': tmp[1],
                'heigt': tmp[2]
            }
        )

print(lst)




