# 1.a=”10”, b=”15”, a і b – це строки, обчислити b/a
a = '10'
a = int(a)
b = '15'
b = int(b)
print(b / a)

# 2.створити словник в якому вказати основні дані про себе, словник має містить ключі значенням якого є інший словник, а також список

person = {
    "name": 'Ihor',
    "age": 28,
    "sex": "Male",

}

# 3.створити масив з 10 елементів і перетворити його в tuple, вивісти зріз перших трьої елементів.
#
# 4.Є три числа, знайти найменше.
#
# 5.Є три числа A, B, C – якщо вони впорядковані по зростанню то до кожного з них добавити 3 і вести їх нові значення, якщо ні то вивести їх протилежне число ( помножити на -1 ).
#
# 6.Дано три числа. Знайти суму двох найбільших з них.
#
# 7.Розв'язати квадратне рівняння ( пояснював на зайнятті )